setScreenMetrics(1080, 2340);
bpm = 90;
pi = 60 / 90 * 1000;
one = pi;	//一分音符
two = one / 2; //二分音符
four = two / 2; //四分音符
eight = four / 2; //八分音符
function A1()
    press(760,100,1);//低音1
function A2()
    press(960,100,1);//低音2
function A3()
    press(1160,100,1);//低音3
function A4()
    press(1360,100,1);//低音4
function A5()
press(1560,100,1);//低音5
function A6()
press(760,300,1);//低音6
function A7()
press(960,300,1);//低音7
function B1()
press(1160,300,1);//中音1
function B2()
press(1360,300,1);//中音2
function B3()
press(1560,300,1);//中音3
function B4()
press(760,500,1);//中音4
function B5()
press(960,500,1);//中音5
function B6()
press(1160,500,1);//中音6
function B7()
press(1360,500,1);//中音7
function C1()
press(1560,500,1);//高音1

function Y1()
sleep(one)
function Y2()
sleep(two)
function Y4()
sleep(four)
function Y8()
sleep(eight)

//第一小节//
	B1();
	Y1();
	B1();
	Y1();
	B1();
	Y1();
	B3();
	Y1();

//第二小节//
	B6();
	Y1();
	B6();
	Y1();
	B6();
	Y1();
	B5();
	Y1();
	//第三小节//
	B3();
	Y1();
	B3();
	Y1();
	B3();
	Y1();
	B3();
	Y1();
	//第四小节//
	A7();
	Y1();
	A7();
	Y1();
	A7();
	Y1();
	A6();
	Y1();

i=1;
j=1;
while(j<=2){
	j++;
	while(i<=2){
		i++;
		//第一小节//
		B1();
		A6();
		Y2();

		A3();
		Y2();

		B1();
		Y2();

		A3();
		Y2();

		B1();
		Y2();

		A3();
		Y2();

		B3();
		Y2();

		A3();
		Y2();

		//第二小节//
		B6();
		A4();
		Y2();

		A6();
		Y2();

		B6();
		B1();
		Y2();

		A6();
		Y2();

		B6();
		A4();
		Y2();

		A6();
		Y2();

		B5();
		Y2();

		A6();
		Y2();

		//第三小节//
		B3();
		A1();
		Y2();

		A3();
		Y2();

		B3();
		A5();
		Y2();

		A3();
		Y2();

		B3();
		A1();
		Y2();

		A3();
		Y2();

		B3();
		A5();
		Y2();

		A3();
		Y2();

		//第四小节//
		A7();
		A5();
		Y2();

		A2();
		Y2();

		A7();
		Y2();

		A2();
		Y2();

		A7();
		Y2();

		A2();
		Y2();

		A6();
		Y2();

		A2();
		Y2();
	}

	//第九小节//
	B1();
	A6();
	Y2();

	B1();
	Y2();

	B1();
	A3();
	Y2();

	B1();
	Y2();

	B1();
	A3();
	Y2();

	B1();
	Y2();

	B1();
	A3();
	Y4();

	B1();
	Y4();

	B1();
	Y4();

	B1();
	Y4();

	//第十小节//
	B6();
	A4();
	Y2();

	B6();
	A6();
	Y2();

	B6();
	B1();
	Y2();

	B6();
	A6();
	Y2();

	B6();
	A4();
	Y2();

	B6();
	B1();
	Y2();

	B5();
	Y2();

	B5();
	Y2();

	//第十一小节//
	B3();
	A1();
	Y2();

	B3();
	A3();
	Y2();

	B3();
	A5();
	Y2();

	B3();
	A3();
	Y2();

	B3();
	A1();
	Y2();

	B3();
	A3();
	Y2();

	B3();
	A5();
	Y4();

	B3();
	Y4();

	B3();
	A3();
	Y4();

	B3();
	Y4();

	//第十二小节//
	A7();
	A5();
	Y2();

	A7();
	Y2();

	A7();
	A2();
	Y2();

	A7();
	Y2();

	A7();
	A2();
	Y2();

	A7();
	Y2();

	A6();
	Y2();

	A6();
	Y2();

	//第十三小节//
	B1();
	A6();
	Y2();

	B1();
	Y2();

	B1();
	A3();
	Y2();

	B1();
	Y2();

	B1();
	A3();
	Y2();

	B1();
	Y2();

	B1();
	A3();
	Y4();

	B1();
	Y4();

	B1();
	Y4();

	B1();
	Y4();

	//第十四小节//
	B6();
	A4();
	Y2();

	B6();
	A6();
	Y2();

	B6();
	B1();
	Y2();

	B6();
	A6();
	Y2();

	B6();
	A4();
	Y2();

	B6();
	B1();
	Y2();

	B5();
	Y2();

	B5();
	Y2();

	//第十五小节//
	B3();
	A1();
	Y2();

	B3();
	A3();
	Y2();

	B3();
	A5();
	Y2();

	B3();
	A3();
	Y2();

	B3();
	A1();
	Y2();

	B3();
	A3();
	Y2();

	B3();
	A5();
	Y4();

	B3();
	Y4();

	B3();
	Y4();

	B3();
	Y4();

	//第十六小节//
	A7();
	A5();
	Y4();

	i=1;
	while(i<=11){
		i++;
		A7();
		Y4();
	}

	A7();
	Y2();

	A6();
	Y2();
}

C1();
B6();
A3();






















